# Задания на 1 неделе

---

### Задача 1: Написать программу, выводящая фразу "Hello, *User*!"

В данной задаче были применены класс 'Scanner', который позволяет считывать вводимые значения с клавиатуры<br>
Также метод 'System.out.println' для вывода результата

---

### Задача 2: Вывести максимальное и минимальное значение числовых типов данных


