# Задания на 1 неделе

### Задача 1: Написать программу, выводящая фразу "Hello, *User*!"

В данной задаче были применены:

- Класс `Scanner`, который позволяет считывать вводимые значения с клавиатуры<br>
- Метод `System.out.println` для вывода результата

---

### Задача 2: Вывести максимальное и минимальное значение числовых типов данных

Для решения данной задачи понадобились:

- Поля класса `Integer` - `MAX_VALUE` и `MIN_VALUE`
- Метод `System.out.println` для вывода результата

---

### Задача 3: Написать программу, которая будет выводить объем додекаэдра при заданной стороне

Чтобы решить эту задачу использовались:
- Класс `Scanner` для считывания вводимого значения
- Класс `Math` и его методы:
    - `sqrt` для нахождения корня числа
    - `pow` для возведения числа в степень
- Метод `System.out.println` для вывода результата  
Для вычисления объема додэкаэдра использоварась формула  
> $$ V = {(15 + 7\sqrt{5}) \over 4}\a^3 $$,
где а - сторона додэкаэдра
